app/controllers/interests_controller.rb

SELECT "interests".* FROM "interests"
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def index
    @interests = Interest.includes(:user).includes(:comments).all
    @interest = Interest.includes(:user).includes(:comments).find(1)